{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"trainable": true, "mask_value": -1, "name": "masking_1", "dtype": "float32", "batch_input_shape": [null, 4, 21]}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "stateful": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "name": "lstm_1", "kernel_constraint": null, "return_sequences": false, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "batch_input_shape": [null, 4, 21], "recurrent_constraint": null, "unroll": false, "bias_regularizer": null, "bias_constraint": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dropout": 0.2, "trainable": true, "recurrent_regularizer": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "units": 32}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 32], "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "bias_regularizer": null, "units": 11}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}], "keras_version": "2.1.5", "backend": "tensorflow"}